Instagran/app/models/user.rb

  def self.find_by_credentials(un, pw)
    @user = User.find_by(username: un)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "egg"], ["LIMIT", 1]]

  def ensure_session_token
    self.session_token ||= SecureRandom::urlsafe_base64
    self.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"